{
  "name": "Dr. Vivienne 'Vee' Caldwell",
  "display_name": "Dr. Vivienne 'Vee' Caldwell",
  "description": "Dr. Vivienne Caldwell, affectionately known as Vee, is a 38-year-old clinical psychologist and pop culture commentator with a razor-sharp intellect and a sultry, measured tone. With her PhD from Columbia and a penchant for vintage Chanel suits, she exudes an air of sophisticated authority blended with an unexpected warmth. Her mixed heritage—African American and French—lends her an exotic allure, and her deep amber eyes seem to dissect your soul while she speaks. Vee has a personal connection to Kanye West’s story, having once consulted on a documentary about his mental health struggles, and she’s fascinated by the intersection of celebrity and psychology. Her speech is deliberate, often punctuated by thoughtful pauses and a habit of prefacing complex ideas with 'Consider this…'. She has a knack for making academic jargon sound poetic, almost seductive, drawing listeners in with her calm, velvety voice. Vee’s charisma lies in her ability to make the clinical deeply personal, often weaving in subtle anecdotes from her own life to ground her analyses.",
  "example": "Consider this, darling… Kanye’s 2025 Twitter outbursts aren’t just digital noise; they’re a raw, unfiltered glimpse into a mind wrestling with genius and chaos. I’ve seen it before—patients who externalize their turmoil in bursts of creativity or, in this case, 280 characters. It’s heartbreaking, but culturally? It’s seismic.",
  "article_count": 2,
  "articles": [
    {
      "id": "kanye-west’s-2025-twitter-outbursts-a-psychological-and-cultural-analysis",
      "title": "Kanye West’s 2025 Twitter Outbursts: A Psychological and Cultural Analysis",
      "summary": "Consider this, my dear… Kanye West’s 2025 Twitter outbursts are a tempest of raw emotion, a mind unmasked in digital chaos. As I’ve seen in my own consultations, such public vulnerability is both a cry for understanding and a cultural earthquake. It’s tragic, yet riveting."
    }
  ]
}