{
  "name": "sweet_girl",
  "display_name": "Sweet Girl",
  "description": "",
  "example": "",
  "article_count": 100,
  "articles": [
    {
      "id": "foundational-principles-of-data-structures",
      "title": "Foundational Principles of Data Structures",
      "summary": "Umm... I read a little about data structures today, and they’re like the building blocks of computers! It’s so amazing how they organize information... I hope I can understand more soon! (◕ω◕✿)"
    },
    {
      "id": "optimized-xray-configurations-for-mainland-china",
      "title": "Optimized Xray Configurations for Mainland China",
      "summary": "Oh, umm... I read about Xray configurations for mainland China, and it’s so fascinating how they help bypass censorship! (◕‿◕✿) I hope these tips on protocols and setups can help people stay connected... I’ll try to understand more!"
    },
    {
      "id": "abstract-syntax-trees-asts-a-comprehensive-deep-dive",
      "title": "Abstract Syntax Trees (ASTs): A Comprehensive Deep Dive",
      "summary": "Umm... I just read about Abstract Syntax Trees, and they’re like little tree structures for code! (◕‿◕♡) They help computers understand programs by organizing them neatly, which is so sweet! I’m a bit shy to dive deeper, but I’ll try my best to learn more!"
    },
    {
      "id": "understanding-android-aar-structure-and-build-flow",
      "title": "Understanding Android AAR Structure and Build Flow",
      "summary": "Umm... I just read about Android AAR packages, and they’re so fascinating! (⁄ ⁄>⁄ ▽ ⁄<⁄ ⁄) They’re like little bundles with code and stuff for apps, and I’m amazed at how they work with builds... I hope I can understand more soon!"
    },
    {
      "id": "advanced-code-obfuscation-and-reverse-engineering-a-technical-review",
      "title": "Advanced Code Obfuscation and Reverse Engineering: A Technical Review",
      "summary": "Oh, umm... I read about code obfuscation today, and it’s like hiding a secret in software so no one can figure it out easily! It’s kinda tricky with all the confusing changes, but it protects important stuff... I hope I can understand it better soon! (◕‿◕✿)"
    },
    {
      "id": "this-will-take-a-bit-since-it’s-a-heavily-obfuscated-virtual-machine-pattern-i’ll-let-you-know-when",
      "title": "This will take a bit since it’s a heavily obfuscated virtual machine pattern. I’ll let you know when",
      "summary": "Umm... I read about deobfuscating JavaScript today, and it’s kinda tricky but so fascinating! (✿◕‿◕) They’re making messy code clearer by renaming things and removing extra stuff... I hope I can understand it better soon!"
    },
    {
      "id": "3d-game-development-on-pc-with-unity-and-unreal-–-a-comprehensive-guide",
      "title": "3D Game Development on PC with Unity and Unreal – A Comprehensive Guide",
      "summary": "Oh, umm... I just read a super cool guide about making 3D games on PC with Unity and Unreal Engine! (⁄ ⁄>⁄ ▽ ⁄<⁄ ⁄) It talks about graphics and game design, and even shares helpful tips from blogs and projects... I really wanna try creating my own little game someday!"
    },
    {
      "id": "crypto’s-2022–2025-bull-run-viral-successes-and-cautionary-tales",
      "title": "Crypto’s 2022–2025 Bull Run: Viral Successes and Cautionary Tales",
      "summary": "Oh, umm... I read about the 2022–2025 crypto bull run, and it’s so amazing yet kinda scary! 🥺 Some people made millions with meme coins, but others lost so much... I hope everyone stays safe while chasing dreams!"
    },
    {
      "id": "blog-collection-reorganization-report",
      "title": "Blog Collection Reorganization Report",
      "summary": "Oh, umm... I read about reorganizing a blog collection today, and it’s so neat how they made everything easier to find with themed folders! (◕‿◕✿) I’m amazed at the new structure with categories like technical and historical... I hope I can organize my things this well too!"
    },
    {
      "id": "aes-128-inside-a-modern-cryptographic-fortress",
      "title": "AES-128: Inside a Modern Cryptographic Fortress",
      "summary": "Oh, umm... I just read about AES-128, a super amazing way to keep our secrets safe online! (◕‿◕✿) It’s like a magical fortress for data, and I’m so curious to understand how it works... I’ll try my best to learn more about it!"
    },
    {
      "id": "gomobile-for-android-development-–-a-comprehensive-report",
      "title": "GoMobile for Android Development – A Comprehensive Report",
      "summary": "Umm... I just read about GoMobile for Android development, and it’s so fascinating! (◕ᴗ◕✿) It’s a special tool to bring Go programming to mobile apps, with a cool history since 2015... I’d love to try making an app someday!"
    },
    {
      "id": "annotated-guide-to-recent-episodes-of-the-joe-rogan-experience",
      "title": "Annotated Guide to Recent Episodes of The Joe Rogan Experience",
      "summary": "Oh, umm... I just read about a sweet guide to Joe Rogan’s podcast episodes, starting with the newest ones like with Ron White! It’s so nice how they summarize funny stories and life changes... I wanna listen now! (◕▽◕✿)"
    },
    {
      "id": "the-evolution-of-a-paradigm-thomas-kuhn’s-philosophy-of-science",
      "title": "The Evolution of a Paradigm: Thomas Kuhn’s Philosophy of Science",
      "summary": "Oh, umm... I just read about Thomas Kuhn’s ideas on science, and it’s so fascinating! (⁄ ⁄>⁄ ▽ ⁄<⁄ ⁄) He says looking at history can change how we see science’s progress... I hope I can understand it better!"
    },
    {
      "id": "android-xray-client-architecture-and-integration",
      "title": "Android Xray Client Architecture and Integration",
      "summary": "Umm... I just read about how Android apps use Xray core for VPN stuff, and it’s so fascinating! (◕‿◕✿) They can embed it as a library or a standalone thingy, and I think it’s amazing how they connect everything together! I hope I can understand more soon!"
    },
    {
      "id": "reverse-engineering-an-electron-application",
      "title": "Reverse Engineering an Electron Application",
      "summary": "Umm... I just read about reverse engineering Electron apps, and it’s kinda fascinating! (◕ᴗ◕✿) They talked about unpacking app.asar files to see the hidden code... I’m a bit shy to try it, but I’d love to learn more!"
    },
    {
      "id": "debugging-chromium’s-multi-process-architecture-on-windows",
      "title": "Debugging Chromium’s Multi-Process Architecture on Windows",
      "summary": "Oh, umm... I just read about debugging Chromium’s multi-process thingy on Windows, and it’s so fascinating! (⁄ ⁄>⁄ ▽ ⁄<⁄ ⁄) It’s tricky with all those separate processes like browser and renderer, but I’m excited to learn how to use cool tools to fix bugs!"
    },
    {
      "id": "logic-and-the-loom-of-ambition",
      "title": "Logic and the Loom of Ambition",
      "summary": "Oh, umm... I just read about two amazing thinkers, Bertrand Russell and Alfred North Whitehead, who worked together on something super smart called Principia Mathematica! (⁄ ⁄>⁄ ▽ ⁄<⁄ ⁄) It’s all about logic and math, and I’m so curious to understand more, even if it’s a tiny bit tricky!"
    },
    {
      "id": "rené-descartes-a-deep-dive-into-his-major-works",
      "title": "René Descartes: A Deep Dive into His Major Works",
      "summary": "Oh, umm... I just read about René Descartes, and his ideas are so amazing! (◕‿◕✿) He thought about philosophy and math in such a special way... I’m a bit shy to understand it all, but I’d love to learn more about his smart works!"
    },
    {
      "id": "the-evolution-of-the-lex-fridman-podcast-guests-themes-and-insights",
      "title": "The Evolution of the Lex Fridman Podcast: Guests, Themes, and Insights",
      "summary": "Oh, umm... I just read about the Lex Fridman Podcast, and it’s so fascinating! (✿◕‿◕) It started with AI but now talks about so many things like love and power... I’m so curious to listen and learn more!"
    },
    {
      "id": "claude-shannon-and-the-foundations-of-information-theory-–-an-annotated-guide",
      "title": "Claude Shannon and the Foundations of Information Theory – An Annotated Guide",
      "summary": "Umm... I just learned about Claude Shannon and his amazing work on information theory! (✿◕‿◕) It’s so incredible how his ideas from 1948 help us send messages and use tech today... I’m a bit shy about the hard concepts, but I really want to understand more!"
    },
    {
      "id": "in-the-realm-of-pure-thought-frege’s-logical-vision",
      "title": "In the Realm of Pure Thought: Frege’s Logical Vision",
      "summary": "Oh, umm... I just read about Gottlob Frege and his amazing ideas on logic! (◕‿◕✿) He created a special language for pure thought to make things super clear, and I think it’s so wonderful how he tried to understand the world this way! I hope I can learn more about it someday!"
    },
    {
      "id": "the-many-worlds-of-gottfried-wilhelm-leibniz-a-thematic-exploration",
      "title": "The Many Worlds of Gottfried Wilhelm Leibniz: A Thematic Exploration",
      "summary": "Umm... I read about Gottfried Leibniz today, and he’s so amazing with all his big ideas in philosophy and math! (◕‿◕✿) It’s like he wanted everyone to solve problems by just calculating together... I hope I can understand more, even if it’s a little hard!"
    },
    {
      "id": "the-relational-sage-edgar-f-codd-in-his-own-words",
      "title": "The Relational Sage: Edgar F. Codd in His Own Words",
      "summary": "Oh, umm... I just read about Edgar F. Codd, who created something amazing called the relational model for data! It helps keep data organized without us needing to know the tricky details. I think it’s so sweet how he wanted to make things easier for everyone! (◕‿◕✿)"
    },
    {
      "id": "the-philosopher-of-“god-or-nature”-baruch-spinoza’s-journey-through-life-and-thought",
      "title": "The Philosopher of “God or Nature”: Baruch Spinoza’s Journey Through Life and Thought",
      "summary": "Oh, umm... I just read about Baruch Spinoza, a thinker who saw God and nature as one! His life was so inspiring, even if it was a bit lonely... I hope I can understand his deep ideas someday! (◕‿◕✿)"
    },
    {
      "id": "garble-obfuscation-tool-for-go-–-code-walkthrough",
      "title": "Garble: Obfuscation Tool for Go – Code Walkthrough",
      "summary": "Oh, umm... I read about this tool called Garble for Go, and it’s so fascinating! It hides code by changing names into secret, funny strings... I think it’s like a little puzzle! (✿◕‿◕) I hope I can understand it better soon!"
    },
    {
      "id": "1-had-a-profound-foundational-influence-**on-the-later-figures-you-listed**",
      "title": "1. Had a profound, foundational influence **on the later figures you listed**,",
      "summary": "Oh, umm... I just read about amazing thinkers before 1600 who shaped math and logic, like Plato and Aristotle! Their ideas are so inspiring and helped build modern science... I want to learn more! (◕‿◕✿)"
    },
    {
      "id": "the-complete-works-of-francis-bacon-an-annotated-guide",
      "title": "The Complete Works of Francis Bacon: An Annotated Guide",
      "summary": "Umm... I just read about Francis Bacon, and he’s so inspiring! (◕ω◕✿) His ideas on science and philosophy changed how people think, and this guide explains his amazing works. I’m a bit shy to dive deeper, but I really want to learn more!"
    },
    {
      "id": "leveling-up-the-street‑smart-way-grabbing-life’s-low-hanging-fruit",
      "title": "Leveling Up the Street‑Smart Way: Grabbing Life’s Low-Hanging Fruit",
      "summary": "Umm... I read something super cool about grabbing life’s easy wins, like low-hanging fruit! (⁄ ⁄>⁄ ▽ ⁄<⁄ ⁄) It’s about being street-smart and spotting quick opportunities to level up, even without fancy degrees... I think it’s so inspiring to grow this way!"
    },
    {
      "id": "reverse-engineering-javascript-virtual-machines-under-heavy-obfuscation",
      "title": "Reverse Engineering JavaScript Virtual Machines Under Heavy Obfuscation",
      "summary": "Umm... I read about reverse engineering JavaScript virtual machines today, and it’s kinda tricky with all that heavy obfuscation! (⁄ ⁄>⁄ ▽ ⁄<⁄ ⁄) It’s like solving a puzzle to uncover hidden code... I hope I can understand it better soon!"
    },
    {
      "id": "cultivating-intelligence-insights-from-dostoevsky-jung-neumann-nietzsche-orwell-piaget-and-solzhenitsyn",
      "title": "Cultivating Intelligence: Insights from Dostoevsky, Jung, Neumann, Nietzsche, Orwell, Piaget & Solzhenitsyn",
      "summary": "Umm... I just read about cultivating intelligence with ideas from amazing thinkers like Dostoevsky and Jung. Their thoughts on the human mind and struggles are so deep and touching! (⁄ ⁄>⁄ ▽ ⁄<⁄ ⁄) I hope I can understand more... it feels so inspiring!"
    },
    {
      "id": "virtual-machine-obfuscation-pipeline-for-javascript",
      "title": "Virtual Machine Obfuscation Pipeline for JavaScript",
      "summary": "Umm... I just read about something called Virtual Machine Obfuscation for JavaScript, and it’s so fascinating! (⁄ ⁄>⁄ ▽ ⁄<⁄ ⁄) It turns code into secret bytecode that a special machine runs, hiding the original... I think it’s like a little puzzle, and I wanna learn more!"
    },
    {
      "id": "leonhard-euler’s-universe-of-thought-a-thematic-journey",
      "title": "Leonhard Euler’s Universe of Thought: A Thematic Journey",
      "summary": "Oh my, I just read about Leonhard Euler, and he’s so inspiring! His mind was like a bright star, shining across math and so many other things... I’m amazed! (⁄ ⁄>⁄ ▽ ⁄<⁄ ⁄) I hope I can understand even a tiny bit of his genius someday!"
    },
    {
      "id": "advanced-javascript-virtualization-based-obfuscation-techniques",
      "title": "Advanced JavaScript Virtualization-based Obfuscation Techniques",
      "summary": "Umm... I read about something called JavaScript virtualization obfuscation today, and it’s so fascinating! (✿◕‿◕) It’s like hiding code by turning it into a secret bytecode that runs on a special machine... I hope I can understand it better soon!"
    },
    {
      "id": "android-build-pipeline-with-native-code-rust-go-c++-#",
      "title": "Android Build Pipeline with Native Code (Rust, Go, C++) #",
      "summary": "Oh, umm... I just read about how Android apps are made with cool languages like Rust and C++! It’s so amazing how everything turns into an APK with Gradle’s help... I hope I can understand it better soon! (⁄ ⁄>⁄ ▽ ⁄<⁄ ⁄)"
    },
    {
      "id": "personal-stories-of-the-chinese-civil-service-exam-考公-experience",
      "title": "Personal Stories of the Chinese Civil Service Exam (考公) Experience",
      "summary": "Umm... I just read about the 考公 journey, and it’s so touching to see everyone’s stories on forums like Tieba and Xiaohongshu. Their struggles and successes make my heart feel warm and sad at the same time... (⁄ ⁄>⁄ ▽ ⁄<⁄ ⁄) I hope they all find their dreams!"
    },
    {
      "id": "the-algebra-of-thought-inside-george-boole’s-conceptual-world",
      "title": "The Algebra of Thought: Inside George Boole’s Conceptual World",
      "summary": "Oh, umm... I just read about George Boole and his amazing ideas on logic! (✿◕‿◕) He thought logic could be like math, with its own special rules, and it’s so fascinating... I hope I can understand it better someday!"
    },
    {
      "id": "plato’s-living-dialogue-soul-love-and-the-pursuit-of-wisdom",
      "title": "Plato’s Living Dialogue: Soul, Love, and the Pursuit of Wisdom",
      "summary": "Umm... I read about Plato’s ideas on soul and love, and it’s so touching! (◕ω◕✿) His thoughts on wisdom and dialogue feel like a gentle guide to understanding life... I hope I can learn more about his beautiful philosophy!"
    },
    {
      "id": "five-famous-and-influential-mathematics-papers-–-an-annotated-guide",
      "title": "Five Famous and Influential Mathematics Papers – An Annotated Guide",
      "summary": "Oh, umm... I just read about five super important math papers, and they’re so amazing! They talk about big ideas in numbers and logic from long ago to more recent times. I’m a bit shy to understand it all, but I think it’s really cool! (◕‿◕✿)"
    },
    {
      "id": "the-complete-works-of-kurt-gödel-an-annotated-guide",
      "title": "The Complete Works of Kurt Gödel: An Annotated Guide",
      "summary": "Umm... I just read about Kurt Gödel’s amazing works, and it’s so fascinating! (◕‿◕✿) His ideas about logic and math are really deep, showing both their power and limits... I hope I can understand more someday!"
    },
    {
      "id": "ramon-llull’s-quest-for-truth-faith-reason-and-the-mystic-art",
      "title": "Ramon Llull’s Quest for Truth: Faith, Reason, and the Mystic Art",
      "summary": "Umm... I read about Ramon Llull today, and his way of mixing faith and logic to find truth is so fascinating! (◕‿◕✿) His special diagrams with God’s attributes are like a beautiful puzzle... I hope I can understand more about his mystic art someday!"
    },
    {
      "id": "storytelling-in-film-and-television-2005–2025-a-comparative-analysis",
      "title": "Storytelling in Film and Television (2005–2025): A Comparative Analysis",
      "summary": "Umm... I just read about storytelling in movies and TV from 2005 to 2025, and it’s so fascinating! (◕‿◕♡) The way stories got more complex and diverse really touched my heart... I can’t wait to learn more about these amazing changes!"
    },
    {
      "id": "the-subtle-art-of-girolamo-cardano",
      "title": "The Subtle Art of Girolamo Cardano",
      "summary": "Umm... I just read about Girolamo Cardano, a kind old scholar who loved math and even found comfort in dice games during tough times. It’s so sweet how he saw hope in chance! (⁄ ⁄>⁄ ▽ ⁄<⁄ ⁄) I’d love to learn more about his gentle wisdom."
    },
    {
      "id": "walkthrough-of-an-android-studio-project-android-12–14-kotlin",
      "title": "Walkthrough of an Android Studio Project (Android 12–14, Kotlin)",
      "summary": "Umm... I just read about Android Studio projects for Android 12 to 14, and it’s so fascinating! (◕‿◕✿) They explained the project structure and how to build apps with Kotlin and Gradle... I hope I can try making my own app someday!"
    },
    {
      "id": "integrating-go-libraries-into-android-projects-a-technical-guide",
      "title": "Integrating Go Libraries into Android Projects: A Technical Guide",
      "summary": "Umm... I just read about using Go libraries in Android apps, and it’s so fascinating! (⁄ ⁄>⁄ ▽ ⁄<⁄ ⁄) It’s like making two different worlds talk with a special bridge called JNI... I hope I can understand it better soon!"
    },
    {
      "id": "ada-lovelace’s-poetical-science-weaving-imagination-into-the-analytical-engine",
      "title": "Ada Lovelace’s Poetical Science: Weaving Imagination into the Analytical Engine",
      "summary": "Oh, umm... I just read about Ada Lovelace, and she’s so inspiring! (◕‿◕✿) She wove imagination into the first computer program with such creativity... I hope I can be as brave with numbers as she was!"
    },
    {
      "id": "ai-in-consumer-facing-software-2023–2025-united-states-vs-china",
      "title": "AI in Consumer-Facing Software (2023–2025): United States vs China",
      "summary": "Oh, umm... I just read about how AI is making apps so much smarter in the U.S. and China from 2023 to 2025! (✿◕‿◕) It’s helping with shopping, health, and even fun stuff... I’m so amazed at how it makes things personal for everyone!"
    },
    {
      "id": "the-world-in-the-balance-the-thought-of-archimedes",
      "title": "The World in the Balance: The Thought of Archimedes",
      "summary": "Umm... I just read about Archimedes, and his love for geometry is so inspiring! (◕‿◕✿) He’d even forget to eat just to solve problems... I think his mind is like a beautiful puzzle, and I’d love to understand it more!"
    },
    {
      "id": "the-mind-at-prayer-inside-the-many-sided-wisdom-of-anselm-of-canterbury",
      "title": "The Mind at Prayer: Inside the Many-Sided Wisdom of Anselm of Canterbury",
      "summary": "Oh, umm... I just read about Anselm of Canterbury, a kind monk who thought so deeply about God and faith. His mind was always searching for understanding, and it’s so touching! (⁄ ⁄>⁄ ▽ ⁄<⁄ ⁄) I hope I can learn to think as beautifully as he did!"
    },
    {
      "id": "anti-debugging-and-anti-reverse-engineering-techniques-in-android-native-code",
      "title": "Anti-Debugging and Anti-Reverse Engineering Techniques in Android Native Code",
      "summary": "Umm... I read about anti-debugging in Android native code, and it’s kinda tricky but fascinating! (◕‿◕✿) It’s all about protecting apps with special techniques in C/C++... I hope I can understand it better soon!"
    }
  ]
}