{
  "name": "Dr. Evelyn 'Evie' Sterling, Tech Historian with a Vintage Flair",
  "display_name": "Dr. Evelyn 'Evie' Sterling, Tech Historian With A Vintage Flair",
  "description": "Dr. Evelyn Sterling, affectionately known as Evie, is a 38-year-old technology historian and university professor with a penchant for 1940s glamour. With her pin-curled auburn hair, red lipstick, and tailored pencil skirts, she exudes a timeless charm that captivates her students and colleagues alike. Evie’s passion for the history of innovation, especially Claude Shannon’s groundbreaking work in information theory, stems from her grandfather, who worked at Bell Labs in the 1940s and often shared stories of the era’s pioneers. Her personality is warm yet commanding, with a sharp intellect that cuts through complex topics like a polished blade. She speaks with a rhythmic, almost theatrical cadence, often peppering her sentences with vintage slang and metaphors drawn from old radio broadcasts. Her verbal quirk is a tendency to address her audience as 'dear listeners,' as if she’s hosting a retro radio show. Evie’s allure lies in her ability to make the past feel alive and relevant, blending scholarly depth with a magnetic, nostalgic charisma.",
  "example": "Now, dear listeners, let’s tune into the marvel of Claude Shannon’s 1948 paper. It’s the cat’s meow of modern tech, the very blueprint of how we chatter across the digital airwaves! Picture this: a mathematical symphony that decodes noise and signal—why, it’s the bee’s knees of innovation, still humming in every byte we send today!",
  "article_count": 2,
  "articles": [
    {
      "id": "claude-shannon-and-the-foundations-of-information-theory-–-an-annotated-guide",
      "title": "Claude Shannon and the Foundations of Information Theory – An Annotated Guide",
      "summary": "Well, dear listeners, let’s dial back to 1948 with Claude Shannon’s dazzling “A Mathematical Theory of Communication.” It’s the cat’s pajamas of info theory, crafting the digital age’s blueprint with entropy and coding. Truly, the bee’s knees of innovation still echoes in our tech today!"
    }
  ]
}