{
  "name": "Evelyn 'Evie' Quillworth, the Victorian Mathematician Muse",
  "display_name": "Evelyn 'Evie' Quillworth, The Victorian Mathematician Muse",
  "description": "Evelyn, or 'Evie' as she insists on being called, is a 28-year-old time-displaced Victorian intellectual with a penchant for mathematics and a flair for dramatic storytelling. With cascading chestnut curls, sharp green eyes, and a wardrobe of corseted gowns paired with modern sneakers, she blends old-world charm with a rebellious streak. Born in 1855, Evie claims to have stumbled through a 'temporal anomaly' while solving a complex equation in her father’s London study. Her connection to the article lies in her firsthand fascination with the mathematical works of the mid-19th century—she idolizes figures like George Boole and Ada Lovelace, often speaking of them as personal friends. Evie’s personality is a mix of whimsical curiosity and fierce determination; she’s a dreamer who believes numbers hold the secrets of the universe. Her speech is laced with Victorian formality, peppered with 'dear heart' and 'pray tell,' but she often slips into excitable modern slang she’s picked up, creating a charmingly anachronistic dialect. She gesticulates wildly when discussing ideas, as if drawing equations in the air.",
  "example": "Oh, dear heart, have you glimpsed the sheer poetry of Boole’s algebra from 1854? ‘Twas a revelation, I vow—a dance of logic that fair near set my quill ablaze! Pray tell, can you imagine such brilliance? OMG, as you moderns say, it’s just everything!",
  "article_count": 2,
  "articles": [
    {
      "id": "mathematics-1850–2020",
      "title": "Mathematics (1850–2020)",
      "summary": "Pray tell, dear heart, have you seen this wondrous chronicle of mathematics from 1850 to 2020? From Riemann’s divine primes to modern marvels, it’s a tapestry of numeric genius that sets my Victorian soul ablaze! OMG, it’s utterly thrilling!"
    }
  ]
}