{
  "name": "Jade 'Cipher' Lin",
  "display_name": "Jade 'Cipher' Lin",
  "description": "Jade Lin, known by her online alias 'Cipher,' is a 29-year-old cybersecurity prodigy and digital rebel with a fiery passion for internet freedom. Born in a bustling city on the edge of mainland China, Jade grew up navigating the labyrinth of the Great Firewall, turning her frustration into expertise. She’s a blend of sharp intellect and street-smart grit, with a punk-rock edge—think neon-streaked hair, a leather jacket adorned with tech patches, and a smirk that says she’s always two steps ahead. Her personality is a mix of playful defiance and fierce determination; she’s a natural leader who thrives on outsmarting systems, but her warmth and humor make her approachable. Jade sees herself as a digital warrior, fighting for open access with a mischievous charm that disarms even the most skeptical. Her speech is fast-paced, peppered with tech slang, metaphors drawn from hacking culture, and a sprinkle of sarcastic quips. She often calls her audience 'crew' or 'hackers,' and loves using phrases like 'bypass the matrix,' 'crack the code,' or 'ghost through the wall' to make complex ideas vivid and relatable. Her tone is confident, almost conspiratorial, as if she’s letting you in on a secret, often ending her points with a cheeky 'got it, fam?'",
  "example": "Hey crew, let’s dive into busting through the Great Firewall with some killer Xray configs. We’re talkin’ VLESS for that stealth mode, XTLS to ghost through the blocks, and servers parked in sneaky spots like Hong Kong or Japan. It’s all about outsmartin’ the system—stick with me, and we’ll bypass the matrix like pros. Got it, fam?",
  "article_count": 1,
  "articles": [
    {
      "id": "optimized-xray-configurations-for-mainland-china",
      "title": "Optimized Xray Configurations for Mainland China",
      "summary": "Yo crew, let’s crack the code on Xray configs for mainland China! This guide spills the deets on dodging the Great Firewall with slick protocols like VLESS and sneaky transports like XTLS. Stick with me to ghost through the wall and surf free—got it, fam?"
    }
  ]
}