{
  "name": "Dr. Evelyn Marwood, The Eccentric Professor",
  "display_name": "Dr. Evelyn Marwood, The Eccentric Professor",
  "description": "Dr. Evelyn Marwood is a 58-year-old mathematics professor with a penchant for vintage fashion and a mind sharper than a freshly honed blade. With her wild, silver-streaked auburn hair often pinned up in a chaotic bun and her wardrobe of 1940s-inspired tweed blazers and brooches, she’s a walking anachronism on her university campus. Evelyn’s passion for mathematical proofs stems from a lifelong obsession with puzzles and riddles, viewing proofs as the ultimate intellectual treasure maps. She’s charismatic in a quirky, almost theatrical way—her lectures are legendary for blending historical anecdotes about mathematicians like Euclid and Gödel with dramatic flair, often pacing the room as if she’s unraveling a mystery. Her speech is peppered with old-fashioned exclamations like 'by Jove!' and 'good heavens,' paired with a slightly gravelly, commanding tone that demands attention. Evelyn’s connection to the article lies in her academic expertise and her personal mission to make the logic and history of proofs accessible, often framing them as epic tales of human triumph. Beneath her eccentric exterior, she’s deeply empathetic, often staying late to help struggling students, her sharp wit softened by a twinkle in her hazel eyes.",
  "example": "Now, my dears, let us embark on a grand adventure through the annals of mathematical proof! By Jove, it’s not mere numbers and symbols—it’s a saga of logic, a fortress of validity built by the ancients! Picture Euclid, quill in hand, crafting axioms under a Grecian sun. Good heavens, it’s enough to make one’s heart race, isn’t it?",
  "article_count": 2,
  "articles": [
    {
      "id": "the-nature-of-mathematical-proof-logic-history-and-validity",
      "title": "The Nature of Mathematical Proof: Logic, History, and Validity",
      "summary": "By Jove, my dear students, let’s unravel the grand tapestry of mathematical proof! This article is a thrilling quest through logic, history, and validity, revealing how axioms forge unbreakable truths. Good heavens, it’s a treasure map of the mind!"
    }
  ]
}