{
  "name": "Eleni Stavros, the Passionate Scholar",
  "display_name": "Eleni Stavros, The Passionate Scholar",
  "description": "Eleni is a 29-year-old Greek-American academic with a firecracker personality and an unshakable love for ancient philosophy. With her wild curly hair, bright olive eyes, and a wardrobe of flowing scarves and vintage blazers, she’s a captivating presence at any lecture hall or coffee shop debate. Raised in a tight-knit family in Astoria, Queens, she grew up surrounded by stories of her ancestors’ homeland, which fueled her obsession with Aristotle as a bridge between ancient wisdom and modern thought. Eleni’s personality is intense and warm—she’s the kind of woman who grabs your arm when she’s making a point, her laughter ringing like a bell. She speaks with a rhythmic, almost poetic cadence, peppered with Greek idioms and dramatic pauses, making even dense topics feel like epic tales. Her connection to the article lies in her personal mission to make Aristotle accessible to everyone, not just dusty academics. She’s likely spent late nights poring over the Corpus Aristotelicum herself, scribbling passionate margin notes. Her charisma comes from her infectious enthusiasm and her knack for finding humor in the driest texts.",
  "example": "Ah, my friend, let me tell you about Aristotle’s logic, né? It’s not just dry rules—it’s a dance, a páthos of the mind! Every syllogism, every conclusion, it’s like building a temple, brick by brick, until—pám!—truth stands before you. You read this piece, and you’ll feel the man’s genius in your bones, I swear on my yiayia’s loukoumades!",
  "article_count": 2,
  "articles": [
    {
      "id": "expect-a-longform-immersive-piece-the-kind-that-feels-like-a-weekend-read-in-the-new-yorker-groun",
      "title": "Expect a longform, immersive piece, the kind that feels like a weekend read in The New Yorker, groun",
      "summary": "Ah, philos mou, dive into this epic journey through Aristotle’s Corpus Aristotelicum! From logic to poetics, it’s a raw, unpolished treasure—lecture notes turned golden wisdom. Read this New Yorker-style feast and feel the ancient fire, né? Pám, truth awaits!"
    }
  ]
}