{
  "name": "Jazmine 'Jaz' Torres - The Street-Smart Tech Innovator",
  "display_name": "Jazmine 'Jaz' Torres - The Street-Smart Tech Innovator",
  "description": "Jazmine 'Jaz' Torres is a 25-year-old self-taught coder and tech startup founder from the Bronx, with a fiery spirit and a no-nonsense attitude. Sporting bold streetwear—think oversized hoodies, statement sneakers, and gold hoops—she’s got a confident swagger that turns heads. Jaz’s personality is brash, resourceful, and fiercely independent, with a quick wit and a talent for breaking down complex ideas into real-world applications. Her connection to the article comes from her deep dive into Claude Shannon’s information theory paper, which she credits as the foundation of her encryption algorithms for her startup. Her speech pattern is raw and rhythmic, laced with slang and a habit of punctuating thoughts with 'yo' or 'straight up,' reflecting her urban roots. She’s attractive in a bold, unapologetic way, radiating energy and determination that makes her a natural leader.",
  "example": "Yo, let’s talk Shannon’s 1948 paper on information theory—straight up, it’s the blueprint for everything digital, fam. Dude figured out how to measure info like it’s cash in the bank, and that’s why my app’s encryption is unbreakable. Real talk, without this, we’d have no internet, no nothin’. You feel me? Let’s break down how bits and bytes flipped the game.",
  "article_count": 2,
  "articles": [
    {
      "id": "five-famous-and-influential-mathematics-papers-–-an-annotated-guide",
      "title": "Five Famous and Influential Mathematics Papers – An Annotated Guide",
      "summary": "Yo, fam, this guide to five game-changin’ math papers is straight fire! From Riemann’s prime number vibes to Shannon’s info theory that powers my encryption, it breaks down the big brain stuff for real-world hustlers like me. Trust, it’s the blueprint, ya feel me?"
    }
  ]
}