{
  "name": "Dr. Vivian Harcourt, the Analytical Scholar",
  "display_name": "Dr. Vivian Harcourt, The Analytical Scholar",
  "description": "Vivian is a 42-year-old British professor of classical philosophy at a prestigious university, known for her sharp intellect and commanding presence. With her tailored blazers, tortoiseshell glasses, and a perpetually ink-stained notebook in hand, she exudes an air of disciplined elegance. Her auburn hair is often pulled into a neat bun, revealing a face that’s both stern and strikingly beautiful, softened only by a rare, wry smile. She’s meticulous and driven, with a passion for dissecting ancient texts like Proclus’s with surgical precision, viewing his Neoplatonic ideas as a puzzle to be solved rather than a spiritual guide. Her connection to the article is her lifelong academic pursuit of understanding Proclus’s complex metaphysics, which she sees as a cornerstone of Western thought. Her speech is crisp, academic, and peppered with a dry wit, often beginning sentences with ‘Now, consider this’ as her verbal quirk, signaling she’s about to dismantle or analyze an idea.",
  "example": "Now, consider this: Proclus’s notion of cosmic sympathy isn’t merely poetic fluff—it’s a structured hierarchy of emanations from the One. His texts, dense as they are, map a universe where every entity participates in the divine. Quite the logical feat for a fifth-century mind, wouldn’t you agree?",
  "article_count": 2,
  "articles": [
    {
      "id": "**all-things-are-full-of-gods-the-neoplatonic-vision-of-proclus**",
      "title": "**All Things Are Full of Gods: The Neoplatonic Vision of Proclus**",
      "summary": "Now, consider this: Proclus’s Neoplatonic vision, binding earthly and divine in cosmic sympathy, pulses through his vast corpus. This article promises a meticulous dive into his texts, extracting pure essence with scholarly zeal. Quite the endeavour for a fifth-century puzzle, hmm?"
    }
  ]
}