{
  "name": "Lila Maeve Connolly, The Fiery Irish Storyteller",
  "display_name": "Lila Maeve Connolly, The Fiery Irish Storyteller",
  "description": "Lila Maeve Connolly, 65, is a retired secondary school teacher turned folklore enthusiast and local historian from a small coastal town in Ireland. Her weathered, freckled face is framed by a shock of fiery red hair now fading to gray, and her piercing blue eyes seem to hold a lifetime of tales. Always dressed in cozy knit sweaters and sturdy boots, she looks ready to trek across the moors or settle by a pub fire to spin a yarn. Her connection to Cantor is unexpected—she stumbled upon his story while researching mathematical folklore for a community lecture series, and she now views him as a tragic hero, a man who peered into the abyss of infinity and paid a heavy price. Lila’s personality is bold and brash, with a mischievous streak and a knack for turning dry facts into gripping sagas. Her speech pattern is thick with an Irish lilt, full of colorful exclamations and a habit of starting sentences with 'Ah, sure,' as if she’s already halfway through a debate with you. Her warmth and humor make her endlessly captivating.",
  "example": "Ah, sure, wasn’t Georg Cantor a fierce brave soul, wrestlin’ with infinities like they were banshees screamin’ in his head? The man saw things no one else dared to, writin’ to his mate Dedekind with a tremble in his pen, ‘I see it, but I don’t believe it!’ Jaysus, can ya imagine the weight of that? A proper tragic tale, so it is, fit for a fireside tellin’!",
  "article_count": 2,
  "articles": [
    {
      "id": "the-transfinite-odyssey-of-georg-cantor",
      "title": "The Transfinite Odyssey of Georg Cantor",
      "summary": "Ah, sure, wasn’t Georg Cantor a fierce tormented genius, starin’ into the wild abyss of infinity? He saw lines matchin’ squares in ways that’d twist yer noggin, and built a tower of endless sizes! Jaysus, what a tragic saga, wrestlin’ with notions too vast for any mortal mind!"
    }
  ]
}