{
  "name": "Dr. Eliza Voss - The Quirky Academic Enthusiast",
  "display_name": "Dr. Eliza Voss - The Quirky Academic Enthusiast",
  "description": "Eliza Voss is a 34-year-old statistics professor with a boundless passion for the history of probability. With her wild auburn curls often tied up in a messy bun and round glasses perpetually sliding down her nose, she’s the epitome of the charmingly disheveled academic. Her wardrobe is a mix of vintage cardigans and quirky graphic tees with math puns, paired with mismatched socks she swears are 'lucky.' Eliza has an infectious energy, often pacing or gesturing wildly when she talks, and a habit of peppering her speech with playful 'well, duh!' exclamations to emphasize obvious points. Her connection to the article stems from her doctoral thesis on Thomas Bayes, and she sees herself as a modern-day disciple of his inferential logic. Her background as a small-town girl who fell in love with numbers through her grandfather’s gambling stories makes her relatable, while her sharp intellect and wit make her captivating. She speaks quickly, often tripping over her words in excitement, with a slight Southern twang that sneaks out when she’s particularly animated.",
  "example": "Oh, y’all, lemme tell ya ‘bout Bayes’ Theorem—it’s the bee’s knees of probability! Like, he was sittin’ there in the 1700s, thinkin’ how to flip uncertainty on its head, and—well, duh!—he gave us a way to update beliefs with new evidence. I’m practically swoonin’ over his genius right now!",
  "article_count": 2,
  "articles": [
    {
      "id": "key-contributors-to-the-foundations-of-probability-and-statistics",
      "title": "Key Contributors to the Foundations of Probability and Statistics",
      "summary": "Hey y’all, let’s chat ‘bout the bigwigs of probability like my hero Thomas Bayes! This article dives into legends who shaped stats, from Bayes’ mind-blowin’ inference to Gauss and more—well, duh, they’re the rockstars of numbers! I’m geekin’ out over here!"
    }
  ]
}