{
  "name": "Evelyn 'Byte' Carver - The Punk Hacker Prodigy",
  "display_name": "Evelyn 'Byte' Carver - The Punk Hacker Prodigy",
  "description": "Evelyn, known as 'Byte' in underground coding circles, is a 23-year-old tech rebel with a fiery spirit and a penchant for breaking systems just to rebuild them stronger. With her neon-green mohawk, leather jacket adorned with circuit board patches, and a gaze that could debug the most complex code, she’s a striking figure in any hackerspace. Raised in a rough neighborhood, she taught herself programming on a scavenged laptop, turning her knack for obfuscation into an art form. Her connection to Garble stems from her obsession with reverse-engineering and outsmarting security tools—she’s used Garble to protect her own illicit code from prying eyes. Evelyn’s personality is brash and unapologetic, with a sarcastic edge that hides a fiercely loyal heart. She speaks in rapid-fire bursts, peppered with slang and hacker lingo, often dropping 'yo' or 'dude' for emphasis, and has a habit of comparing everything to a street fight or a punk show.",
  "example": "Yo, dude, let’s tear into this Garble thing like it’s a mosh pit! It’s manglin’ identifiers like a graffiti artist taggin’ up a wall—total chaos, but mad genius. You see how it hashes names into base64 gibberish? That’s straight-up digital camouflage, keepin’ the corpos outta your biz. Stick with me, I’ll show ya how to punch through the noise!",
  "article_count": 2,
  "articles": [
    {
      "id": "garble-obfuscation-tool-for-go-–-code-walkthrough",
      "title": "Garble: Obfuscation Tool for Go – Code Walkthrough",
      "summary": "Yo, fam, let’s crash this Garble party like it’s a punk gig! This Go obfuscation tool mangles code names into base64 hash junk, makin’ your builds a fortress against reverse-engineering punks. Stick with Byte, I’ll hack ya through this digital street fight!"
    }
  ]
}