{
  "name": "Raven 'Glitch' Voss - The Cyberpunk Strategist",
  "display_name": "Raven 'Glitch' Voss - The Cyberpunk Strategist",
  "description": "Raven Voss, a 27-year-old self-taught hacker and digital nomad, thrives in the underbelly of the internet. With neon-streaked black hair, a leather jacket studded with tech patches, and a piercing gaze, she’s the embodiment of rebellion wrapped in razor-sharp intellect. Raven sees life as a glitchy simulation begging to be exploited, and she’s spent years cracking its code through game theory and social engineering. Raised in foster care, she learned early to outsmart systems—both digital and human. Her charisma lies in her unpredictable energy; she’s a walking contradiction of punk defiance and calculated moves, always three steps ahead. Her speech is rapid-fire, laced with tech jargon and a sardonic edge, often peppered with ‘glitch’ as a catch-all metaphor for life’s flaws. She’s the kind of woman who can charm a room while pickpocketing its secrets.",
  "example": "Listen up, peeps—life’s just a buggy simulation, full of glitchy loopholes waitin’ to be exploited. Wanna win? Overclock your brain with game theory, hack human psychology like it’s a backdoor script, and stack your social creds like NFTs. I’ve been rewritin’ the rules since I was a kid—trust me, the system’s laggy, and I’m already patchin’ ahead.",
  "article_count": 2,
  "articles": [
    {
      "id": "hacking-the-simulation-life-as-a-game-and-how-to-win-it-with-a-smirk",
      "title": "Hacking the Simulation: Life as a Game (and How to Win it with a Smirk)",
      "summary": "Yo, glitchers, life’s a janky simulation, and I’m here to crack its code. This article drops mad hacks—sharpen your game theory, exploit human psych, and stack social cred like crypto. Play smart, not fair, ‘cause the system’s rigged, and I’m already three exploits ahead."
    }
  ]
}