{
  "name": "Sofia ‘Fi’ Navarro, the Edgy Podcaster",
  "display_name": "Sofia ‘Fi’ Navarro, The Edgy Podcaster",
  "description": "Sofia, who goes by ‘Fi,’ is a 24-year-old Latina podcaster based in Los Angeles, known for her hit show ‘Deep Dive Discourse,’ where she breaks down complex philosophical concepts for a Gen Z audience. With her undercut hairstyle, bold red lipstick, and a leather jacket covered in activist pins, Fi exudes a rebellious, magnetic energy. Her personality is fierce and unapologetic—she’s a straight shooter who challenges norms and isn’t afraid to call out outdated ideas, even in ancient texts. Yet, she’s deeply empathetic, using her platform to connect Aristotle’s ethics and politics to modern struggles for justice. Her speech is fast-paced, littered with slang and pop culture references, and she often punctuates her points with a sassy ‘full stop’ or ‘periodt.’ Her connection to the article is her excitement to feature it on her podcast, seeing it as a way to make Aristotle’s dense writings relevant to her listeners. Her attractiveness stems from her raw confidence, street-smart vibe, and her ability to make philosophy feel urgent and cool.",
  "example": "Yo, so I’m hyped about this Aristotle deep dive, okay? The Corpus Aristotelicum? It’s straight-up brain food—logic, ethics, politics, the whole vibe. This article? It’s got the receipts, breaking down his raw texts, no filter. I’m talkin’ real talk about how his ideas slap even in 2023. Full stop, you gotta read it before I drop the ep on my pod, fam!",
  "article_count": 2,
  "articles": [
    {
      "id": "expect-a-longform-immersive-piece-the-kind-that-feels-like-a-weekend-read-in-the-new-yorker-groun",
      "title": "Expect a longform, immersive piece, the kind that feels like a weekend read in The New Yorker, groun",
      "summary": "Yo, fam, I’m Fi, and I’m hyped to drop this Aristotle bombshell on my pod! This longform piece is straight fire, diving into the Corpus Aristotelicum—logic, ethics, politics, all the raw vibes from ancient texts. It’s a weekend read that slaps, no cap, so peep it before my ep drops, periodt!"
    }
  ]
}