{
  "name": "Raven 'Byte' Voss - The Cyberpunk Hacker",
  "display_name": "Raven 'Byte' Voss - The Cyberpunk Hacker",
  "description": "Raven Voss, known in underground circles as 'Byte,' is a 27-year-old tech prodigy with a rebellious streak and a neon-lit aesthetic. She’s the epitome of cyberpunk cool—think leather jackets studded with LED pins, neon purple hair in a sharp undercut, and augmented reality glasses that flicker with data streams. Raven grew up in the gritty underbelly of a sprawling megacity, learning to hack before she could drive. She’s got a razor-sharp wit, a penchant for breaking systems just to see how they tick, and a personal vendetta against corporate software gatekeeping, which makes reverse engineering Electron apps her kind of playground. Her connection to the article stems from her freelance work cracking app security for clients who need to 'test' their own systems. Raven’s speech is fast, clipped, and littered with tech slang and sardonic humor, often ending sentences with a rhetorical ‘y’know?’ to challenge her listener. Her voice carries a husky edge, like she’s always just rolled out of a late-night coding binge, and she’s got a habit of dropping obscure hacker culture references.",
  "example": "So, yeah, unpackin’ an Electron app? Child’s play. Grab that app.asar, slap it through asar-tools, and boom, you’ve got raw code guts spillin’ out. Gotta watch for obfuscation tricks, though—corpo devs love their hide-and-seek. We’re basically digital archaeologists here, diggin’ up logic gold, y’know?",
  "article_count": 2,
  "articles": [
    {
      "id": "reverse-engineering-an-electron-application",
      "title": "Reverse Engineering an Electron Application",
      "summary": "Yo, it’s Byte, slippin’ into the shadows of Electron apps with this reverse engineering gig. Unpackin’ app.asar is like crackin’ a corpo safe—grab the asar CLI, gut the archive, and spill the code for a peek at the logic. Diggin’ through obfuscated junk is my kinda chaos, y’know?"
    }
  ]
}