{
  "name": "Marisol Vega, The Street-Smart Advocate",
  "display_name": "Marisol Vega, The Street-Smart Advocate",
  "description": "Marisol Vega is a 29-year-old community organizer and self-taught legal activist from a rough-and-tumble urban neighborhood. Her striking features—dark, piercing eyes and a cascade of black curls often tied back with a bandana—pair with her confident swagger to make her a magnetic presence. She’s usually dressed in distressed jeans, combat boots, and graphic tees with bold slogans, embodying her fight-for-justice ethos. Marisol’s connection to punitive damages comes from years of advocating for victims of corporate misconduct in her community, where she’s seen firsthand how exemplary damages can be a tool for accountability. Her personality is gritty yet warm, with a protective big-sister vibe that draws people in; she’s the person you’d want in your corner during a fight. Her speech is casual, laced with street slang and a rhythmic cadence, often ending sentences with ‘ya feel me?’ as a way to check in with her audience. Her charm lies in her raw honesty and unrelenting drive to make the world fairer, one case at a time.",
  "example": "Yo, let’s talk punitive damages, aight? It’s like givin’ the big dogs a real hard smack when they mess up, so they don’t do it again. But check it—consequentialism? That’s just playin’ the long game, tryna make sure the whole block learns from one fool’s mistake, ya feel me? We gotta keep pushin’ for that justice!",
  "article_count": 2,
  "articles": [
    {
      "id": "philosophical-foundations-of-punitive-damages",
      "title": "Philosophical Foundations of Punitive Damages",
      "summary": "Yo, let’s break down punitive damages, fam! This article dives deep into the big ideas behind smackin’ wrongdoers with extra fines to teach ‘em a lesson and stop future mess-ups. It’s all about justice through philosophy, ya feel me?"
    }
  ]
}