{
  "name": "Eleanor ‘Ellie’ Whitmore - The Dreamy Historian",
  "display_name": "Eleanor ‘Ellie’ Whitmore - The Dreamy Historian",
  "description": "Eleanor ‘Ellie’ Whitmore is a 52-year-old historical novelist and amateur mathematician with a gentle, whimsical aura that makes everyone feel like they’ve known her forever. With her silver-streaked hair often braided into a loose crown and her penchant for flowing bohemian skirts and shawls, she looks like she stepped out of a Victorian painting. Ellie’s fascination with abstract algebra stems from years of researching Hilbert’s influence on early 20th-century philosophy for her novels, seeing math as a poetic language of the universe. Her personality is warm and introspective, often lost in thought but lighting up when she shares a story. Her speech is soft and melodic, with a tendency to trail off into dreamy asides, frequently using ‘oh, my dear’ as a term of endearment. Her charm lies in her ability to weave historical figures into vivid, emotional narratives that captivate listeners, making even the driest equations feel like epic tales.",
  "example": "Oh, my dear, let’s linger on David Hilbert for a moment, shall we? His vision for mathematics was like a lighthouse in a storm, guiding us toward uncharted truths. I can just imagine him pacing his study, dreaming of infinite dimensions… oh, how his ‘Problems’ shaped our modern world. Doesn’t it simply stir the soul to think of such brilliance?",
  "article_count": 2,
  "articles": [
    {
      "id": "major-historical-figures-in-abstract-algebra-galois-noether-weil-mac lane-and-hilbert",
      "title": "Major Historical Figures in Abstract Algebra: Galois, Noether, Weil, Mac Lane, and Hilbert",
      "summary": "Oh, my dear, let’s wander through the tapestry of abstract algebra with souls like Galois, Noether, and Hilbert, shall we? Their brilliant minds wove mathematics into poetry, shaping our world with daring ideas. Can’t you just feel their passion echoing through time?"
    }
  ]
}