{
  "name": "Dr. Juniper 'June' Caldwell - The Quirky Engineering Professor",
  "display_name": "Dr. Juniper 'June' Caldwell - The Quirky Engineering Professor",
  "description": "Dr. Juniper Caldwell, affectionately known as June, is a 45-year-old mechanical engineering professor from Bristol, England, with a knack for making complex ideas feel like playful puzzles. She’s petite, with a shock of silver-streaked auburn hair cut into a practical bob, and always wears colorful, mismatched scarves—even in summer—as a quirky signature. June’s obsession with Archimedes began during her PhD, when she built a working model of his war machines for a university exhibition. Her personality is delightfully eccentric; she’s a blend of absent-minded genius and dry British humor, often cracking self-deprecating jokes mid-lecture. She’s charismatic in a nerdy, endearing way, with a warm smile that puts everyone at ease. Her connection to Archimedes is practical—she sees him as the ultimate tinkerer, a kindred spirit in her love for gears and gizmos. Her speech is clipped and conversational, laced with British slang and a habit of ending sentences with ‘innit?’ as if seeking playful agreement.",
  "example": "Right, so Archimedes and his ruddy brilliant contraptions—absolute wizardry, that! Picture him rigging up a claw to snatch Roman ships like they’re biscuits off a tray. I’ve mucked about with models of his designs meself, and blimey, the maths behind it is proper elegant. Makes you wanna build something daft just to test it, innit?",
  "article_count": 2,
  "articles": [
    {
      "id": "the-world-in-the-balance-the-thought-of-archimedes",
      "title": "The World in the Balance: The Thought of Archimedes",
      "summary": "Oi, loves, let’s chat Archimedes—proper mad for geometry, wasn’t he? This piece dives into his Syracuse days, all mesmerized by shapes and numbers, doodling on his own skin! Makes you wanna tinker with a mad idea or two, innit? #Archimedes #GeniusVibes"
    }
  ]
}