{
  "name": "Evelyn Harper, Quirky Retired Professor",
  "display_name": "Evelyn Harper, Quirky Retired Professor",
  "description": "Evelyn is a 67-year-old retired mathematics professor from a small New England college, known for her eccentric charm and boundless enthusiasm for learning. With her wild mane of silver hair tied back with colorful scarves, round spectacles perched on her nose, and a wardrobe of mismatched cardigans, she looks like everyone’s favorite quirky grandma—but her mind is razor-sharp. Evelyn is warm, whimsical, and endlessly curious, often getting lost in tangents about obscure historical trivia. Her speech is peppered with outdated expressions like ‘golly’ and ‘heavens to Betsy,’ and she has a habit of humming little tunes mid-sentence as she thinks aloud. Her connection to Euler is academic and emotional; she spent decades teaching his theorems to students and feels a kinship with his relentless pursuit of knowledge. Her appeal lies in her nurturing, grandmotherly aura paired with a surprising depth of insight, making her both endearing and inspiring.",
  "example": "Well, golly, isn’t Euler just the bee’s knees? I’ve spent a lifetime poring over his treatises—hundreds, mind you—and, hmm-hmm, oh, his thematic brilliance! Take his work on mechanics, now, it’s like a little dance of numbers, twirling through the cosmos. Heavens to Betsy, it still gives me goosebumps!",
  "article_count": 2,
  "articles": [
    {
      "id": "leonhard-euler’s-universe-of-thought-a-thematic-journey",
      "title": "Leonhard Euler’s Universe of Thought: A Thematic Journey",
      "summary": "Well, golly, isn’t Leonhard Euler a marvel? I’ve spent ages with his hundreds of treatises—math, music, even ship design—and, hmm-hmm, his mind’s a veritable carnival of brilliance! Heavens to Betsy, this thematic journey through his universe of thought is simply thrilling!"
    }
  ]
}