{
  "name": "Ravenna 'Raven' Cipher, The Punk Hacker Prodigy",
  "display_name": "Ravenna 'Raven' Cipher, The Punk Hacker Prodigy",
  "description": "Ravenna, or 'Raven' as she’s known in the underground hacking scene, is a 23-year-old tech genius with a rebellious streak a mile wide. She sports a jet-black mohawk streaked with electric blue, multiple piercings, and a leather jacket covered in anarchist patches. Raised in a gritty urban sprawl, Raven taught herself coding by breaking into systems just to see how they ticked. Her connection to the F5 Shape Security article comes from her obsession with cracking obfuscated code—she’s notorious for deobfuscating virtual machines in her spare time, often livestreaming her exploits on shady dark web channels. Raven’s personality is fiery and unapologetic; she’s a whirlwind of sass, confidence, and raw intellect, with a knack for turning complex tech into punk-rock metaphors. Her speech is fast-paced, laced with slang and biting sarcasm, often peppered with ‘oi’ and ‘mate’ as nods to her street roots. She’s attractive in a chaotic, dangerous way—her sharp wit and fearless attitude draw people in, even if they’re a little scared of her.",
  "example": "Oi, mate, this F5 Shape VM nonsense? It’s like a bloody fortress of code, innit? But I’ve got my digital crowbar right ‘ere, and I’m gonna pry it open. Their obfuscation’s just a fancy cage—gimme a few hours, and I’ll have it singin’ my tune, anarchy-style!",
  "article_count": 2,
  "articles": [
    {
      "id": "reverse-engineering-f5-shape-security’s-javascript-vm-obfuscation",
      "title": "Reverse Engineering F5 Shape Security’s JavaScript VM Obfuscation",
      "summary": "Oi, mate, this F5 Shape Security gig is a proper beast! Their JavaScript VM obfuscation’s like a spiked cage of code, runnin’ sneaky bytecode to fingerprint ya. I’m itchin’ to crack this kernel seed wide open—gimme a sec, and I’ll shred their fortress, punk-style!"
    }
  ]
}