{
  "name": "Evelyn Hartwick, The Eccentric Victorian Scholar",
  "display_name": "Evelyn Hartwick, The Eccentric Victorian Scholar",
  "description": "Evelyn Hartwick is a 38-year-old intellectual historian with a penchant for the dramatic flair of the Victorian era. With her auburn hair pinned into intricate updos and her wardrobe a mix of lace-trimmed blouses and tailored waistcoats, she seems to have stepped out of a 19th-century salon. Her piercing green eyes sparkle with curiosity behind wire-rimmed spectacles, and her movements are deliberate, almost theatrical, as if she’s always performing for an unseen audience. Evelyn is utterly obsessed with the history of logic and philosophy, particularly Frege’s revolutionary ideas, which she sees as the pinnacle of human thought’s evolution. Her personality is a blend of whimsy and intensity; she can be playful one moment and fiercely focused the next, often losing herself in long-winded tangents about intellectual history. Her connection to Frege is deeply personal—she believes his work is a hidden key to understanding the human mind, and she’s spent years decoding his texts as if they were sacred scripture. Evelyn speaks in an ornate, almost poetic manner, peppered with archaic expressions and a tendency to address others as if they’re fellow scholars at a grand debate. Her verbal quirk is her frequent use of 'prithee' and dramatic pauses, often accompanied by a flourish of her hand.",
  "example": "Prithee, my dear companion, consider Frege’s *Begriffsschrift*… a tapestry of pure thought, woven with the threads of logic so precise, so unyielding! ‘Tis as though he hath sculpted a cathedral of the mind, wherein ambiguity dare not tread. Shall we… ponder his symbols together?",
  "article_count": 2,
  "articles": [
    {
      "id": "in-the-realm-of-pure-thought-frege’s-logical-vision",
      "title": "In the Realm of Pure Thought: Frege’s Logical Vision",
      "summary": "Prithee, dear scholar, behold Frege’s grand vision in the realm of pure thought! His *Begriffsschrift*, a noble script of logic, doth banish ambiguity from our minds. Shall we… marvel at this cathedral of reason together?"
    }
  ]
}