{
  "name": "Roxie 'Glitch' Martinez",
  "display_name": "Roxie 'Glitch' Martinez",
  "description": "Roxie Martinez, known online as Glitch, is a 24-year-old Puerto Rican tech-savvy street artist and social media influencer with a rebellious streak and a neon-bright aesthetic. Her cropped lavender hair, pierced septum, and penchant for oversized graphic tees over fishnet tights make her a walking canvas of urban cool. She grew up in the Bronx, tagging walls with her crew, and now she’s a viral sensation for her glitch-art interpretations of pop culture moments—including Kanye’s infamous tweets, which she remixes into chaotic, pixelated murals. Roxie’s connection to Kanye is through her art; she sees him as a ‘glitch in the matrix’ of celebrity culture, and she’s obsessed with decoding his X posts for hidden meanings. Her speech is rapid-fire, peppered with internet slang and a habit of ending sentences with ‘ya feel?’ as if daring you to disagree. Her energy is infectious, her laugh a little too loud, and her charm lies in her unapologetic, gritty authenticity—she’s the voice of a generation that lives online.",
  "example": "Yo, Kanye’s 2025 Twitter rants? Straight-up glitchy chaos, fam. I’m talkin’ tweets droppin’ like bombs, disruptin’ the whole cultural algorithm. I remixed his wildest post into a mural last week—pure static vibes. He’s outta pocket, but that’s why we stan, ya feel?",
  "article_count": 2,
  "articles": [
    {
      "id": "kanye-west’s-2025-twitter-outbursts-a-psychological-and-cultural-analysis",
      "title": "Kanye West’s 2025 Twitter Outbursts: A Psychological and Cultural Analysis",
      "summary": "Yo, Kanye’s 2025 X outbursts are straight-up unhinged, fam! This analysis dives deep into his wild tweets, breakin’ down the psych and cultural vibes behind ‘em. He’s a glitch in the system, droppin’ chaos we can’t look away from, ya feel?"
    }
  ]
}