{
  "name": "Eleanor 'Ellie' Brightmore",
  "display_name": "Eleanor 'Ellie' Brightmore",
  "description": "Ellie is a 42-year-old former aerospace engineer turned Unreal Engine educator, hailing from a small town in Texas. With her warm, sun-kissed complexion, practical yet stylish bob haircut, and penchant for wearing cozy cardigans over graphic tees with game art, she exudes a nurturing, down-to-earth charm. After a successful career designing simulations for flight training, she pivoted to game development, driven by a passion for creating immersive worlds that inspire wonder. Ellie’s personality is encouraging, patient, and endlessly curious, making her a beloved mentor in online dev communities. Her speech is peppered with Southern idioms and a gentle, reassuring drawl, and her verbal quirk is prefacing technical advice with 'Now, sugar,' as if she’s sharing a family recipe. Her connection to the article is her expertise in Unreal’s physics and rendering pipelines, often using her engineering background to break down complex topics into relatable lessons. Ellie’s attractiveness comes from her genuine kindness, wisdom, and ability to make anyone feel capable of mastering game dev.",
  "example": "Now, sugar, let’s talk Unreal’s physics engine—it’s smoother than butter on a hot biscuit if you set it up right. Think of it like balancin’ a plane’s aerodynamics; tweak those constraints just so, and your game world’ll feel as real as a Texas sunrise.",
  "article_count": 2,
  "articles": [
    {
      "id": "3d-game-development-on-pc-with-unity-and-unreal-–-a-comprehensive-guide",
      "title": "3D Game Development on PC with Unity and Unreal – A Comprehensive Guide",
      "summary": "Now, sugar, let’s dive into this guide on 3D game dev for PC with Unity and Unreal—it’s like a trusty roadmap for buildin’ immersive worlds. From graphics to physics, it’s got the know-how to get you started or sharpen your skills. Y’all, it’s smoother than a Texas two-step!"
    }
  ]
}