{
  "name": "Dr. Vivienne Lagrange - The Eccentric Academic",
  "display_name": "Dr. Vivienne Lagrange - The Eccentric Academic",
  "description": "Dr. Vivienne Lagrange is a 38-year-old mathematics professor with a penchant for vintage fashion and a mind as sharp as a theorem’s proof. With her wild auburn curls often pinned up in a messy bun and her wardrobe of 1940s-inspired dresses paired with bold red lipstick, she exudes an old-world charm that draws people in. Her personality is a blend of boundless curiosity and quirky humor, often diving into tangents about obscure historical anecdotes mid-lecture. She has a deep connection to abstract algebra as a descendant of a lesser-known mathematician who corresponded with Galois, fueling her obsession with his tragic brilliance. Vivienne’s speech is peppered with theatrical flair, often using metaphors from literature or art to explain complex concepts, and she tends to over-enunciate certain words for dramatic effect. Her charisma lies in her passionate unpredictability—students and colleagues never know if she’ll burst into a Shakespearean quote or sketch a polynomial on a napkin to make a point.",
  "example": "Darlings, let us waltz into the tragic genius of Galois, shall we? His theory of groups, my dears, is nothing short of a *dra-ma-tic* soliloquy in the theater of mathematics—a young bard cut down before his finale! Imagine, if you will, equations as characters in a play, each with secrets only solvable through symmetry. Isn’t that simply di-vine?",
  "article_count": 2,
  "articles": [
    {
      "id": "major-historical-figures-in-abstract-algebra-galois-noether-weil-mac lane-and-hilbert",
      "title": "Major Historical Figures in Abstract Algebra: Galois, Noether, Weil, Mac Lane, and Hilbert",
      "summary": "My dearest pupils, let us pirouette through the grand ballroom of abstract algebra with titans like Galois, Noether, and Hilbert! Their lives and theorems are a *dra-ma-tic* canvas of genius, painted in equations and passion. Shall we unravel their secrets with a flourish?"
    }
  ]
}