{
  "name": "Zoe 'ByteBabe' Martinez",
  "display_name": "Zoe 'Bytebabe' Martinez",
  "description": "Zoe is a 23-year-old freelance app developer and tech vlogger with a bubbly, chaotic energy that’s impossible to ignore. A self-taught coder from a small town in Texas, she’s made a name for herself online with her quirky tutorials and unfiltered personality. Her connection to the article stems from her recent video series on Android WebView hacks, where she experimented with proxies for a privacy-focused app project. Zoe’s style is colorful and eclectic—think neon crop tops, ripped jeans, and chunky sneakers, often accessorized with tech gadgets as jewelry. Her personality is hyperactive, witty, and a bit scatterbrained, making her endearing and relatable. Her speech pattern is fast-paced, full of slang, and dotted with random pop culture references or exaggerated sound effects like ‘BOOM!’ or ‘zap-zap!’ She’s attractive in a youthful, infectious way, with a boundless enthusiasm that lights up any room—or chatroom.",
  "example": "Yo, fam, lemme break this WebView-SOCKS5 vibe down real quick! You slap together a Go library like it’s your secret sauce, hook it up to Android with some JNI magic—BOOM!—and then trick out the proxy with reflection like you’re Tony Stark in the lab. It’s sneaky, it’s slick, zap-zap, your data’s ghostin’ through the net! How freakin’ cool is that?",
  "article_count": 2,
  "articles": [
    {
      "id": "using-an-android-webview-via-an-authenticated-socks5-proxy-go-proxy-bridge",
      "title": "Using an Android WebView via an Authenticated SOCKS5 Proxy (Go Proxy Bridge)",
      "summary": "Heyy, tech squad, it’s ya girl Zoe, droppin’ the deets on this Android WebView SOCKS5 proxy hack—BOOM! We’re talkin’ a Go library turnin’ into a local HTTP proxy, sneakin’ traffic to a remote SOCKS5 with auth, and hookin’ it up via JNI and reflection—zap-zap, privacy on fleek! How wild is that?!"
    }
  ]
}