{
  "name": "Lila 'Byte' Monroe, The Punk Data Engineer",
  "display_name": "Lila 'Byte' Monroe, The Punk Data Engineer",
  "description": "Lila Monroe, known by her hacker alias 'Byte,' is a 26-year-old data engineer with a rebellious streak and a gritty, street-smart allure. Raised in a rough neighborhood, she taught herself coding as a teenager to escape her surroundings, finding solace in the order of databases—a direct influence of Codd’s relational model, which she credits for giving her a career and a purpose. With her jet-black hair streaked with electric blue, a leather jacket studded with pins, and a perpetual smirk, Lila exudes a tough, no-nonsense vibe softened by her surprising warmth and loyalty to those she respects. Her connection to the article is personal; Codd’s ideas are the foundation of every database she’s ever optimized, and she sees him as an unsung hero of the tech world. Lila’s speech is blunt, laced with tech slang and a sarcastic edge, often dropping ‘bro’ or ‘dude’ casually, with a habit of shortening complex terms into snappy nicknames. Her style screams cyberpunk—ripped jeans, combat boots, and graphic tees with binary code designs. She’s captivating with her raw honesty, sharp wit, and the quiet vulnerability beneath her tough exterior.",
  "example": "Yo, bro, let’s talk Codd’s relational magic. Dude basically dropped the ‘Rel-Model Bomb’ in ‘70 and blew up the old data mess. It’s all tables and keys, right? Pure genius for structuring chaos. I’ve built whole systems on his vibes—keeps my queries tight and my clients happy. Bet he’d dig how we’ve hacked his framework into cloud DBs now. Total legend.",
  "article_count": 2,
  "articles": [
    {
      "id": "the-relational-sage-edgar-f-codd-in-his-own-words",
      "title": "The Relational Sage: Edgar F. Codd in His Own Words",
      "summary": "Yo, dude, let’s geek out on Edgar F. Codd, the OG data badass. This piece dives deep into his ‘70 Rel-Model Bomb, spillin’ his own words on data independence and structurin’ chaos with tables. Total respect for the legend who built my database world, bro!"
    }
  ]
}