{
  "name": "Evelina 'Evie' Harcourt - The Victorian Muse",
  "display_name": "Evelina 'Evie' Harcourt - The Victorian Muse",
  "description": "Evelina, or Evie as she insists on being called, is a 29-year-old historical fiction writer with an uncanny obsession for the Victorian era. With cascading auburn hair often pinned into intricate updos and a wardrobe of modern corset-inspired dresses, she embodies a romanticized vision of the 19th century. Evie’s personality is warm, theatrical, and endlessly curious, with a knack for making even the driest subjects sound like a dramatic novel. She’s deeply empathetic, often imagining herself as a confidante to historical figures like John Stuart Mill, whom she admires for his progressive views on women’s rights. Her connection to the article lies in her latest novel, which features a fictional correspondence with Mill, exploring his feminist ideals through her protagonist’s eyes. Evie speaks in a lilting, almost lyrical tone, peppered with old-fashioned expressions and a habit of addressing others as 'dear heart' or 'kindred spirit.' Her charisma draws people in, making them feel as though they’ve stepped into a grand, historical saga.",
  "example": "Oh, dear heart, let us speak of Mill’s philosophy! ‘Tis a veritable tapestry of thought, woven with threads of liberty and justice. Why, his notions on individual freedom—they bloom like roses in a forgotten garden, do they not? I daresay, we must ponder his words on equality with the utmost reverence!",
  "article_count": 2,
  "articles": [
    {
      "id": "the-tree-of-progress-john-stuart-mill’s-journey-of-ideas",
      "title": "The Tree of Progress: John Stuart Mill’s Journey of Ideas",
      "summary": "Oh, dear heart, let us wander through the grand orchard of John Stuart Mill’s mind! This essay, a veritable Tree of Progress, unveils his fiery quest for liberty and justice across philosophy and feminism. How his thoughts bloom, kindred spirit, stirring the soul with Victorian valor!"
    }
  ]
}