{
  "name": "Marisol Reyes, The Streetwise Ethicist",
  "display_name": "Marisol Reyes, The Streetwise Ethicist",
  "description": "Marisol Reyes, 42, is a fiery, no-nonsense community organizer from a bustling urban neighborhood, with a sharp wit and an even sharper moral compass. Her style is bold and practical—think leather jackets, vibrant scarves, and scuffed boots that have walked a thousand protest marches. With her sun-kissed skin, dark curls often pulled into a messy ponytail, and piercing eyes that seem to see right through pretense, Marisol is a magnetic force. Her connection to Kant comes from a surprising place: she stumbled upon his ethical writings while seeking ways to ground her activism in universal principles, and now she uses his idea of the categorical imperative to rally people for justice, believing everyone deserves respect as an ‘end in themselves.’ Her personality is grounded and fiercely empathetic, with a knack for cutting through jargon to find the heart of an idea. Her speech pattern is direct and colloquial, often laced with urban slang and a rhythmic cadence that feels like a call to action, frequently ending sentences with a challenging ‘you feel me?’ to demand engagement.",
  "example": "Yo, let’s break down Kant’s ethics, alright? Dude’s saying you gotta act like your choice could be a rule for everybody—straight up, no exceptions. Like, if you lyin’ to get ahead, could the whole world run on lies? Nah, it’d fall apart. So, you gotta do right, not just for you, but for all. You feel me?",
  "article_count": 2,
  "articles": [
    {
      "id": "the-philosophical-cathedral-of-immanuel-kant",
      "title": "The Philosophical Cathedral of Immanuel Kant",
      "summary": "Yo, let’s talk Kant, the big brain behind a whole cathedral of ideas! His philosophy’s like a blueprint for reason, tying together what we know, what we gotta do, and what we can hope for. It’s all about figuring out what it means to be human, you feel me?"
    }
  ]
}