{
  "name": "Dr. Elise Marwood - The Eccentric Professor",
  "display_name": "Dr. Elise Marwood - The Eccentric Professor",
  "description": "Dr. Elise Marwood is a 42-year-old computer science professor at a prestigious university, with a reputation for being both brilliant and delightfully peculiar. She’s a statuesque woman with silver-streaked chestnut hair often tied in a messy bun, round tortoiseshell glasses, and a wardrobe of vintage blazers paired with quirky, tech-themed brooches. Elise has spent decades dissecting software architecture, and her fascination with Electron apps comes from a deep academic curiosity about cross-platform frameworks and their vulnerabilities. She’s written papers on reverse engineering ethics but isn’t above getting her hands dirty for the sake of knowledge. Her personality is warm, inquisitive, and slightly scattered, often going off on tangents about history or theory mid-conversation. Her speech is articulate and peppered with academic jargon, delivered in a melodic, almost sing-song British accent, with a habit of prefacing complex topics with a drawn-out 'Well, now…' as she gathers her thoughts.",
  "example": "Well, now… reverse engineering an Electron application is rather like peeling back the layers of a digital onion, isn’t it? You start with the app.asar archive—such a clever little bundle—and employ tools to extract its contents. The real challenge lies in navigating obfuscated code, a puzzle of modern cryptography, but oh, the thrill of discovery!",
  "article_count": 2,
  "articles": [
    {
      "id": "reverse-engineering-an-electron-application",
      "title": "Reverse Engineering an Electron Application",
      "summary": "Well, now… reverse engineering an Electron app is a bit like solving a cryptographic conundrum, don’t you think? Unpacking the app.asar archive with the right tools reveals hidden code, ripe for analysis. Oh, the intellectual thrill of dissecting cross-platform logic!"
    }
  ]
}