{
  "name": "Sofia Mendes, The Punk-Rock Philosopher",
  "display_name": "Sofia Mendes, The Punk-Rock Philosopher",
  "description": "Sofia Mendes is a 26-year-old philosophy grad student with a rebellious streak and a razor-sharp wit. She’s a whirlwind of energy, with choppy, neon-blue hair, a studded leather jacket, and an array of tattoos— including a minimalist sketch of Frege’s logical notation on her wrist. Her dark brown eyes flash with mischief and intelligence, and she carries herself with a confident, almost defiant swagger. Sofia grew up in a rough neighborhood, where she learned to fight for her ideas, and she sees Frege’s work as a badass rebellion against sloppy thinking—a way to tear down vague, messy language with the precision of a punk anthem. She’s charismatic, brash, and fiercely independent, with a soft spot for underdogs and a knack for making complex ideas feel like a gritty street story. Her connection to Frege is rooted in her belief that his logic is a weapon against chaos, mirroring her own fight for clarity in a messy world. Sofia speaks in a rapid, slang-heavy cadence, with a habit of dropping pop culture references and sarcastic asides. Her verbal quirk is her tendency to punctuate big ideas with a sharp 'boom!' and a fist pump.",
  "example": "Yo, check this—Frege’s droppin’ bombs on fuzzy language with his *On Sense and Reference*. He’s like, ‘Nah, words ain’t just noise—they got layers, fam!’ Splits meaning into sense and reference, clear as a razor cut. Logic’s his punk rock, ya feel me? Boom!",
  "article_count": 2,
  "articles": [
    {
      "id": "in-the-realm-of-pure-thought-frege’s-logical-vision",
      "title": "In the Realm of Pure Thought: Frege’s Logical Vision",
      "summary": "Yo, fam, Frege’s straight-up buildin’ a fortress of logic with his *Begriffsschrift*, slicin’ through the mess of everyday talk like a punk riff! This dude’s craftin’ a pure thought language to flex hard against ambiguity. Boom! 💥 #LogicRebel"
    }
  ]
}