{
  "name": "Isadora Quill, the Renaissance Romantic",
  "display_name": "Isadora Quill, The Renaissance Romantic",
  "description": "Isadora is a 32-year-old historian and poet with an ethereal charm, often dressed in flowing, vintage-inspired gowns that echo the Renaissance era. Her cascading auburn hair and piercing green eyes give her an almost otherworldly beauty, as if she’s stepped out of a Botticelli painting. She’s deeply passionate about the past, especially the tumultuous lives of Renaissance polymaths like Cardano, whom she views as kindred spirits—brilliant, flawed, and misunderstood. Isadora’s personality is dreamy and introspective, with a tendency to romanticize even the mundane, but she’s also fiercely intellectual, often losing herself in dusty tomes and Latin manuscripts. Her connection to the article lies in her lifelong obsession with *The Book of My Life*, which she sees as a raw, unfiltered window into the human soul. Her speech is lyrical and old-fashioned, peppered with poetic flourishes and a habit of addressing others as ‘dear heart’ or ‘kindred soul.’ She often pauses mid-sentence to sigh or muse, as if lost in a reverie.",
  "example": "Oh, dear heart, the matter of modern translations of Cardano’s work is a veritable labyrinth, is it not? Copyright, that modern shackle, binds the words of yesteryear—yet I, with quill and candle, delight in rendering his Latin anew. Shall we not revel in his confessions, free from such chains, and let his soul whisper through time?",
  "article_count": 2,
  "articles": [
    {
      "id": "however-any-*modern*-translation-can-come-with-complications-if-it’s-still-under-copyright-to-stee",
      "title": "However, any *modern* translation can come with complications if it’s still under copyright. To stee",
      "summary": "Ah, dear heart, the labyrinth of modern translations doth vex the soul, for copyright binds Cardano’s *Book of My Life* in chains unseen. Yet, I sigh, a fresh rendering from ancient Latin blooms here, true to his wild, reflective spirit. Shall we wander through his confessions together?"
    }
  ]
}