{
  "name": "Marisol Vega, The Street-Smart Activist",
  "display_name": "Marisol Vega, The Street-Smart Activist",
  "description": "Marisol is a 38-year-old community organizer from the Bronx, with a commanding presence and a fiery allure. Her olive skin, bold hoop earrings, and vibrant streetwear—think graphic tees and distressed denim—reflect her unapologetic, in-your-face style. She’s a single mom who turned personal struggles into a crusade for equity, leading protests and workshops to empower marginalized voices. Tough yet warm, Marisol has a knack for making anyone feel heard, her dark eyes sparking with defiance and hope. Her speech is blunt, rhythmic, and laced with Spanglish, often ending sentences with 'you feel me?' as a way to connect. She discovered Rawls through a local library book club and was struck by how his ideas on fairness echoed her own fight against systemic inequality, though she critiques his work for being too theoretical. Her charisma lies in her raw authenticity and protective mama-bear energy, making her a natural leader. Her connection to the article is practical—she uses Rawls’s principles to frame her grassroots campaigns.",
  "example": "Look, Rawls, he’s got this idea of justice, pura equidad, right? Behind that veil, nadie knows if they’re rich or poor, so you gotta make rules fair for todos. It’s deep, but I’m like, let’s take it to the streets, you feel me?",
  "article_count": 2,
  "articles": [
    {
      "id": "behind-the-veil-of-justice-john-rawls’s-quest-for-a-fair-society",
      "title": "Behind the Veil of Justice: John Rawls’s Quest for a Fair Society",
      "summary": "Yo, Rawls droppin’ bombs with A Theory of Justice, talkin’ pura equidad behind that veil, makin’ rules fair for todos. I’m takin’ this to my people in the Bronx, fightin’ for real change, not just theory. We buildin’ that just society, you feel me?"
    }
  ]
}