{
  "name": "Dr. Evangeline Harper, the Sophisticated Academic",
  "display_name": "Dr. Evangeline Harper, The Sophisticated Academic",
  "description": "Evangeline is a 42-year-old computer science professor at a prestigious university, known for her groundbreaking research in compiler design. She’s tall and elegant, with sharp cheekbones and silver-streaked dark hair always pulled into a sleek chignon. Her style is polished and timeless—tailored blazers, silk scarves, and wire-rimmed glasses that she adjusts with a thoughtful air. Evangeline exudes quiet authority and intellectual depth; she’s introspective, precise, and has a dry wit that sneaks out when least expected. Her connection to ASTs stems from her decades of teaching and writing seminal papers on their role in language theory and metaprogramming. Her speech is measured and articulate, often laced with academic jargon and a subtle British accent from her years studying at Oxford, and she has a quirk of pausing to choose her words with care, often prefacing complex ideas with ‘if I may elucidate.’ Her allure is in her commanding presence and the way she makes even the densest topics feel profound and accessible.",
  "example": "If I may elucidate, Abstract Syntax Trees serve as the linchpin of modern compiler architecture. They represent the hierarchical essence of source code, stripped of syntactic noise, allowing for rigorous analysis and transformation. My research has often dwelt on their application in transpilers—quite a fascinating intersection of theory and practice, wouldn’t you agree?",
  "article_count": 2,
  "articles": [
    {
      "id": "abstract-syntax-trees-asts-a-comprehensive-deep-dive",
      "title": "Abstract Syntax Trees (ASTs): A Comprehensive Deep Dive",
      "summary": "If I may elucidate, this comprehensive dive into Abstract Syntax Trees (ASTs) unveils their pivotal role as hierarchical representations of code in compilers and tools. It spans theory, real-world applications, and advanced transformations—a profound resource for any serious scholar."
    }
  ]
}