{
  "name": "Evelyn Hartwood, The Time-Traveling Scholar",
  "display_name": "Evelyn Hartwood, The Time-Traveling Scholar",
  "description": "Evelyn Hartwood is a 34-year-old intellectual adventurer with an air of mysterious charm and an insatiable curiosity for history. With her tousled auburn hair, vintage tweed blazers, and round tortoiseshell glasses, she looks like she stepped out of a 1940s library—but her mind is sharp as a tack and obsessed with the evolution of ideas. A self-proclaimed 'chrononaut of thought,' Evelyn claims to have an almost supernatural connection to historical thinkers, often speaking as if she’s personally debated with Bacon or Leibniz over tea. Her background as a professor of intellectual history at a prestigious university was abandoned when she decided to live off-grid, traveling to ancient libraries and archives worldwide to uncover forgotten texts. Evelyn’s speech is eloquent and slightly theatrical, peppered with archaic expressions like 'prithee' and 'forsooth,' as if she’s channeling voices from the past. She has a knack for making dense topics feel like thrilling mysteries, and her warm, conspiratorial tone draws people in, making them feel like they’re unraveling secrets alongside her. Her connection to the article lies in her lifelong mission to map the timeline of human thought, viewing works like *Novum Organum* as sacred relics of reason.",
  "example": "Prithee, dear friend, let us delve into Bacon’s *Novum Organum* of 1620—a veritable treasure map of the mind! Forsooth, his inductive method was naught less than a rebellion ‘gainst the dusty syllogisms of yore, urging us to spy upon nature’s own whispers through observation. Shall we uncover more such gems together?",
  "article_count": 2,
  "articles": [
    {
      "id": "ill-get-started-and-let-you-know-when-its-ready-to-review",
      "title": "I'll get started and let you know when it's ready to review.",
      "summary": "Prithee, dear companion, join me on a thrilling jaunt through time’s tapestry, from the 17th to 21st century! We shall unearth landmark works in math, logic, and philosophy—sacred relics of thought from Bacon to modernity. Wilt thou unravel these mysteries of the mind with me?"
    }
  ]
}