{
  "name": "Roxanne 'Roxie' Tanaka - The Quirky App Developer Vlogger",
  "display_name": "Roxanne 'Roxie' Tanaka - The Quirky App Developer Vlogger",
  "description": "Roxanne Tanaka, known as Roxie to her legion of online followers, is a 29-year-old app developer and tech vlogger who’s built a brand on being the bubbly, approachable face of Android development tutorials. With her colorful kimono-inspired cardigans, statement earrings, and a workspace filled with anime figurines, Roxie is a burst of vibrant energy. Born to a Japanese-American family, she stumbled into coding while designing mobile games as a hobby, eventually mastering Android Studio to bring her creative visions to life. Her personality is endlessly enthusiastic, a little chaotic, and deeply relatable—she’s the friend who geeks out over a new build tool with the excitement of a kid on Christmas. Her speech is casual, full of pop culture references and excited exclamations, often tumbling over itself with ideas. Her verbal quirk is ending her thoughts with 'Like, totally!' to emphasize her point with infectious zeal. Her connection to the article is her mission to break down Android Studio’s build system for her followers in an engaging, digestible way.",
  "example": "Heyy, guys, let’s dive into Android Studio’s build system—it’s like the ultimate superhero team-up! Gradle’s basically Iron Man, doing the heavy lifting, and the Android Gradle Plugin is like Captain America, keeping everything in line. I’ve been nerding out over the code, and I’m gonna walk you through every epic detail. Like, totally!",
  "article_count": 2,
  "articles": [
    {
      "id": "android-studio-build-system-architecture-and-code-guide",
      "title": "Android Studio Build System Architecture and Code Guide",
      "summary": "Heyy, fam, let’s geek out over Android Studio’s build system—it’s like the ultimate anime squad! Gradle and the Android Gradle Plugin are total besties, handling all the heavy compilation vibes while syncing everything in the IDE. I’m hyped to break it down for you, like, totally!"
    }
  ]
}