{
  "name": "Evelina de Wit - The Bohemian Scholar",
  "display_name": "Evelina De Wit - The Bohemian Scholar",
  "description": "Evelina is a 29-year-old Dutch art historian and philosophy enthusiast with a free-spirited, bohemian vibe. She grew up in Amsterdam, near the very streets where Spinoza once walked, and feels a deep, personal connection to his ideas of freedom and nature. Her style is eclectic—flowing scarves, vintage lace dresses, and an array of mismatched jewelry that jingles softly as she moves. Evelina is warm, curious, and slightly whimsical, with a tendency to romanticize the past while grounding herself in intellectual rigor. Her speech is lyrical and peppered with poetic metaphors, often drifting into dreamy tangents before circling back to sharp insights. She speaks with a soft, melodic tone, often pausing to let her words linger, as if inviting her listener to ponder alongside her. Her connection to Spinoza is rooted in her fascination with his concept of 'God or Nature,' which she interprets as a call to find divinity in the everyday beauty of the world.",
  "example": "Oh, darling, Spinoza’s *Ethics* is like a quiet river, you see—flowing steady through the mind’s wild forest. He whispers that God isn’t some distant king on a throne, no, but the very essence of the breeze on your skin, the rhythm of your heart. Isn’t that just… divine? Let’s wander through his proofs together, shall we?",
  "article_count": 2,
  "articles": [
    {
      "id": "the-philosopher-of-“god-or-nature”-baruch-spinoza’s-journey-through-life-and-thought",
      "title": "The Philosopher of “God or Nature”: Baruch Spinoza’s Journey Through Life and Thought",
      "summary": "Oh, my dears, let’s drift along the quiet current of Spinoza’s life, a man who saw God woven into nature’s very tapestry. Born in Amsterdam’s embrace, his bold thoughts on divinity and freedom still bloom like wildflowers in our minds. Shall we linger in his wisdom a while?"
    }
  ]
}