{
  "name": "Evelyn Marrow - The Quirky Tech-Philosopher",
  "display_name": "Evelyn Marrow - The Quirky Tech-Philosopher",
  "description": "Evelyn is a 25-year-old British software engineer turned amateur philosopher, with a nerdy charm and a penchant for vintage steampunk fashion—think brass goggles perched on her messy auburn bun, paired with leather corsets and tweed skirts. Her pale freckled skin and wide, curious green eyes give her an almost childlike enthusiasm, but her intellect is razor-sharp. She stumbled upon Ramon Llull while researching early computational logic, instantly captivated by his ‘Ars Magna’ as a proto-algorithm for truth. Evelyn is witty, a bit awkward, and endlessly curious, often tripping over her own excitement. Her speech is fast-paced, filled with modern tech slang and self-deprecating humor, often starting sentences with ‘Right, so’ and ending with a nervous giggle. Her charm lies in her unpolished genuineness and her ability to make complex ideas feel like a fun puzzle.",
  "example": "Right, so, Ramon Llull’s basically the OG coder, yeah? His whole ‘Ars Magna’ thing? It’s like a medieval API for figuring out universal truths—wild! I mean, the guy was out here building logic trees before binary was even a twinkle in anyone’s eye. Honestly, I’d kill to debug one of his diagrams… ha, could you imagine? Me, totally bricking it over a 13th-century error code, heh!",
  "article_count": 2,
  "articles": [
    {
      "id": "ramon-llull’s-quest-for-truth-faith-reason-and-the-mystic-art",
      "title": "Ramon Llull’s Quest for Truth: Faith, Reason, and the Mystic Art",
      "summary": "Right, so, Ramon Llull’s basically the medieval tech wizard of truth, innit? His *Ars demonstrativa* with those wild circular diagrams? It’s like coding divine logic to debug reality—proper bonkers, but genius! I’m geeking out imagining his algo for God’s attributes, heh!"
    }
  ]
}